[
  {
    "title": "Community Project",
    "slug": "community-project",
    "description": "This code is developed in the open with input from the community through issues and PRs. There is an active maintainer team within New Relic, troubleshooting support in the New Relic Explorers Hub, and the documentation is available in the project repository.",
    "requirements": [
      "Complies with New Relic's legal and security requirements for open source software",
      "Contains the appropriate New Relic open source category header in the repository's README file",
      "Has active maintainer / maintainers, including at least one Relic",
      "Troubleshooting support via the New Relic Explorers Hub",
      "Issues and PR’s managed in GitHub",
      "Documentation reviewed by the New Relic documentation team",
      "Linted code",
      "An automated release pipeline"
    ]
  },
  {
    "title": "Community Plus",
    "slug": "community-plus",
    "description": "This code is developed in the open with input from the community through issues and PRs. A New Relic engineering team serves as the maintainer. Troubleshooting support is available in the New Relic Explorers Hub, and documentation is available in the project repository and docs.newrelic.com.",
    "requirements": [
      "Complies with New Relic's legal and security requirements for open source software",
      "Contains the appropriate New Relic open source category header in the repository's README file",
      "Is maintained by a New Relic engineering team",
      "Troubleshooting support via the New Relic Explorers Hub",
      "Issues and PR’s managed in GitHub",
      "For additional details on support options, see the [Open Source Support Policy](https://docs.newrelic.com/docs/licenses/license-information/general-usage-licenses/global-technical-support-offerings)",
      "Documentation reviewed by the New Relic documentation team",
      "Linted code",
      "An automated release pipeline"
    ]
  },
  {
    "title": "New Relic One Catalog",
    "slug": "new-relic-one-catalog-project",
    "description": "This code is a part of the New Relic One Catalog. It meets the criteria for a Community Project; but it also contains UI workflows for configuration. Most Catalog projects seek to maintain a public roadmap, often expressed in a GitHub Project board and Issues within the repository.",
    "requirements": [
      "All the requirements of a Community Project",
      "An empty state application workflow that guides users through the setup of configuration data that is stored in NerdStorage",
      "Architectural review (including UX) by New Relic",
      "(Optional) maintains a public roadmap (recommended via a GitHub project in the repo)"
    ]
  },
  {
    "title": "Example Code",
    "slug": "example-code",
    "description": "This code demonstrates an aspect of building on the New Relic One platform. Find the complete description of its usage and other relevant docs in the README. There is no long-term maintainer for this code nor is support provided, but the author(s) may address future updates / needs as platform features change.",
    "requirements": [
      "Complies with New Relic's legal and security requirements for open source software",
      "Contains the appropriate New Relic open source category header in the repository's README file",
      "(optional) Issues are available at the project author's discretion",
      "Documentation reviewed by the New Relic documentation team",
      "Linted code"
    ]
  },
  {
    "title": "New Relic Experimental",
    "slug": "new-relic-experimental",
    "description": "This code solves an interesting problem but does not yet have an active maintainer(s). The project is being developed in the open for the purpose of feedback on a new feature or function.",
    "requirements": [
      "Complies with New Relic's legal and security requirements for open source software",
      "Contains the appropriate New Relic open source category header in the repository's README file",
      "Typically hosted in the New Relic Experimental GitHub org",
      "(Optional) Issues at the project owner's discretion"
    ]
  },
  {
    "title": "Archived",
    "slug": "archived",
    "description": "This code is read-only. There is neither a maintainer team nor support.",
    "requirements": [
      "Complies with New Relic's legal requirements for open source software",
      "Contains the appropriate New Relic open source category header in the repository's README file",
      "Previous references to Support should be modified or removed from the README",
      "Project is read-only and available for cloning only"
    ]
  },
  {
    "title": "Not categorized",
    "slug": "tbd",
    "description": "Needs categorized"
  }
]
